01Hub/fbedit/STM32F4Discovery/STM32F4_Scope/Scope/main.c
/*******************************************************************************
* File Name          : main.c
* Author             : KetilO
* Version            : V1.0.0
* Date               : 07/06/2012
* Description        : Main program body
********************************************************************************

/* Includes ------------------------------------------------------------------*/
#include "stm32f4_discovery.h"

/* Private define ------------------------------------------------------------*/
#define ADC_CDR_ADDRESS           ((uint32_t)0x40012308)
#define PE_IDR_Address            ((uint32_t)0x40021011)

#define STM32_DataSize            ((uint16_t)1024*6/2)
#define STM32_BlockSize           ((uint8_t)64)

/* STM32_Command */
#define STM32_CommandWait         ((uint8_t)0)
#define STM32_CommandInit         ((uint8_t)1)
#define STM32_CommandDone         ((uint8_t)99)

/* STM32_Modes */
#define STM32_ModeNone            ((uint8_t)0)
#define STM32_ModeScopeCHA        ((uint8_t)1)
#define STM32_ModeScopeCHB        ((uint8_t)2)
#define STM32_ModeScopeCHACHB     ((uint8_t)3)
#define STM32_ModeHSClockCHA      ((uint8_t)4)
#define STM32_ModeHSClockCHB      ((uint8_t)5)
#define STM32_ModeHSClockCHACHB   ((uint8_t)6)
#define STM32_ModeLGA             ((uint8_t)7)
#define STM32_ModeDDSWave         ((uint8_t)8)

/* STM32_Triggers */
#define STM32_TriggerManual       ((uint8_t)0)
#define STM32_TriggerRisingCHA    ((uint8_t)1)
#define STM32_TriggerFallingCHA   ((uint8_t)2)
#define STM32_TriggerRisingCHB    ((uint8_t)3)
#define STM32_TriggerFallingCHB   ((uint8_t)4)
#define STM32_TriggerLGA          ((uint8_t)5)
#define STM32_TriggerLGAEdge      ((uint8_t)6)

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  uint8_t   Command;
  uint8_t   Mode;
  uint8_t   DataBlocks;
  uint8_t   TriggerMode;
  uint8_t   TriggerValue;
  uint8_t   TriggerMask;
  uint8_t   TriggerWait;
  uint8_t   ScopeDataBits;
  uint8_t   ScopeSampleClocks;
  uint8_t   ScopeClockDiv;
  uint8_t   ScopeAmplifyCHA;
  uint8_t   ScopeAmplifyCHB;
  uint8_t   ScopeDCNullOutCHA;
  uint8_t   ScopeDCNullOutCHB;
  uint16_t  LGASampleRate;
  uint8_t   DDS_WaveType;
  uint8_t   DDS_SweepMode;
  uint32_t  DDS_PhaseAdd;
  uint16_t  DDS_Amplitude;
  uint16_t  DDS_DCOffset;
  uint32_t  SWEEP_Add;
  uint16_t  SWEEP_StepTime;
  uint16_t  SWEEP_StepCount;
  uint32_t  SWEEP_Min;
  uint32_t  SWEEP_Max;
}CommandStructTypeDef;

typedef struct
{
  uint32_t  Frequency;
  uint32_t  PreviousCount;
  uint16_t  HSCEnable;
  uint16_t  HSCClockDiv;
  uint16_t  HSCCount;
  uint16_t  HSCDuty;
}FRQDataStructTypeDef;

typedef struct
{
  FRQDataStructTypeDef FRQDataStructCHA;                // 0x20000014
  FRQDataStructTypeDef FRQDataStructCHB;                // 0x20000024
  CommandStructTypeDef CommandStruct;                   // 0x20000034
  uint16_t STM32_Data[STM32_DataSize];                  // 0x2000005E
}STM32_DataStructTypeDef;

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
__IO STM32_DataStructTypeDef STM32_DataStruct;          // 0x20000014

/* Private function prototypes -----------------------------------------------*/
void RCC_Config(void);
void NVIC_Config(void);
void GPIO_Config(void);
void TIM_Config(void);
void ADC_DVMConfig(void);
void ADC_SCPConfig(void);
void DMA_SCPConfig(void);
void DMA_LGAConfig(void);
void USART_Config(void);
void WaitForTrigger(void);

/* Private functions ---------------------------------------------------------*/

/*******************************************************************************
* Function Name  : main
* Description    : Main program
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
int main(void)
{
  u32 i;
  uint8_t *Adr;

  asm("add  sp,#0x10000");

  RCC_Config();
  NVIC_Config();
  GPIO_Config();
  TIM_Config();
  ADC_DVMConfig();
  USART_Config();
  while (1)
  {
    if (STM32_DataStruct.CommandStruct.Command == STM32_CommandInit)
    {
      /* Reset STM32_CommandInit */
      STM32_DataStruct.CommandStruct.Command = STM32_CommandWait;
      switch (STM32_DataStruct.CommandStruct.Mode)
      {
        case STM32_ModeScopeCHA...STM32_ModeScopeCHACHB:
          DMA_SCPConfig();
          ADC_SCPConfig();
          WaitForTrigger();
          /* Start ADC1 Software Conversion */
          ADC1->CR2 |= (uint32_t)ADC_CR2_SWSTART;
          while (DMA_GetFlagStatus(DMA2_Stream0,DMA_FLAG_TCIF0)==RESET);
          STM32_DataStruct.CommandStruct.Command = STM32_CommandDone;
          ADC_Cmd(ADC1, DISABLE);
          ADC_Cmd(ADC2, DISABLE);
          DMA_DeInit(DMA2_Stream0);
          break;
        case STM32_ModeHSClockCHA:
          if (STM32_DataStruct.FRQDataStructCHA.HSCEnable)
          {
            /* TIM4 disable counter */
            TIM_Cmd(TIM4, DISABLE);
            /* Reset count */
            TIM4->CNT = 0;
            /* Set the Autoreload value */
            TIM4->ARR = STM32_DataStruct.FRQDataStructCHA.HSCCount;
            /* Set the Prescaler value */
            TIM4->PSC = STM32_DataStruct.FRQDataStructCHA.HSCClockDiv;
            /* Set the Capture Compare Register value */
            TIM4->CCR2 = STM32_DataStruct.FRQDataStructCHA.HSCDuty;
            /* TIM4 enable counter */
            TIM_Cmd(TIM4, ENABLE);
          }
          else
          {
            /* TIM4 disable counter */
            TIM_Cmd(TIM4, DISABLE);
          }
          STM32_DataStruct.CommandStruct.Command = STM32_CommandDone;
          break;
        case STM32_ModeHSClockCHB:
          if (STM32_DataStruct.FRQDataStructCHB.HSCEnable)
          {
            /* TIM10 disable counter */
            TIM_Cmd(TIM10, DISABLE);
            /* Reset count */
            TIM10->CNT = 0;
            /* Set the Autoreload value */
            TIM10->ARR = STM32_DataStruct.FRQDataStructCHB.HSCCount;
            /* Set the Prescaler value */
            TIM10->PSC = STM32_DataStruct.FRQDataStructCHB.HSCClockDiv;
            /* Set the Capture Compare Register value */
            TIM10->CCR1 = STM32_DataStruct.FRQDataStructCHB.HSCDuty;
            /* TIM10 enable counter */
            TIM_Cmd(TIM10, ENABLE);
          }
          else
          {
            /* TIM10 disable counter */
            TIM_Cmd(TIM10, DISABLE);
          }
          STM32_DataStruct.CommandStruct.Command = STM32_CommandDone;
          break;
        case STM32_ModeLGA:
          STM_EVAL_LEDToggle(LED4);
          TIM8->CNT=0;
          TIM8->ARR=STM32_DataStruct.CommandStruct.LGASampleRate;
          DMA_LGAConfig();
          TIM_DMACmd(TIM8, TIM_DMA_Update, ENABLE);
          /* DMA2_Stream1 enable */
          DMA_Cmd(DMA2_Stream1, ENABLE);
          WaitForTrigger();
          TIM8->CR1 |= TIM_CR1_CEN;
          while (DMA_GetFlagStatus(DMA2_Stream1,DMA_FLAG_TCIF1)==RESET);
          STM32_DataStruct.CommandStruct.Command = STM32_CommandDone;
          DMA_DeInit(DMA2_Stream1);
          TIM_Cmd(TIM8, DISABLE);
          break;
        case STM32_ModeDDSWave:
          /* Send configuration data to DDS Wave Generator */
          Adr = (uint8_t *)&STM32_DataStruct.CommandStruct.DDS_WaveType;
          i=0;
          while (i<26)
          {
            /* Wait until transmit register empty*/
            while((USART6->SR & USART_FLAG_TXE) == 0);          
            /* Transmit Data */
            USART6->DR = (uint16_t)(uint8_t) *Adr;
            i++;
            Adr++;
          }
          STM32_DataStruct.CommandStruct.Command = STM32_CommandDone;
          break;
      }
    }
    i=0;
    while (i < 1000000)
    {
      i++;
    }
    ADC_SoftwareStartInjectedConv(ADC3);
  }
}

